---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.JoinElementsFailures.CannotJoinElementsStructuralError
source: html/7bfe838f-839c-3e53-c410-a0ca9c68b742.htm
---
# Autodesk.Revit.DB.BuiltInFailures.JoinElementsFailures.CannotJoinElementsStructuralError Property

Can't keep elements joined.

## Syntax (C#)
```csharp
public static FailureDefinitionId CannotJoinElementsStructuralError { get; }
```